<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of RansomWhere (UI) persistent malware checker with VirusTotal integration and imports into Munki repository.</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.RansomWhere</string>
	<key>Input</key>
	<dict>
		<key>repo_subdirectory</key>
		<string>apps/Objective-See</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
            <key>description</key>
            <string>https://objective-see.com/products/ransomwhere.html
Let's try to generically thwart OS X ransomware via math! By continually monitoring the file-system for the creation of encrypted files by suspicious processes, RansomWhere? aims to protect your personal files, generically stopping ransomware in its tracks.
            </string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
            <string>%NAME%</string>
            <!--
            	# TODO: These only useful if using the ZIP download, not DMG/PKG.
            <key>postinstall_script</key>
            <string>#!/bin/bash
/Applications/RansomWhere.app/Contents/MacOS/RansomWhere -install
            </string>
            <key>preuninstall_script</key>
            <string>#!/bin/bash
/Applications/RansomWhere.app/Contents/MacOS/RansomWhere -uninstall
            </string>
	        -->
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jps3.download.RansomWhere</string>
	<key>Process</key>
	<array>
		<!--
			# TODO: Version can be taken from the newly-introduced JSON feed, no?
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app/Contents/Info.plist</string>
			</dict>
		</dict>
		-->
		<!--
			# TODO: This should only be necessary if the ZIP file is downloaded.
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
			</dict>
		</dict>
		-->
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
				<key>pkg_path</key>
				<string><!-- %RECIPE_CACHE_DIR%/%NAME%-%version%.dmg --></string>
            </dict>
		</dict>
	</array>
</dict>
</plist>
